### pandas
- It is one of the most important modules of data science
- used to work with data in the form of frames/table
- stands for paneldata
- data analysis,manipulation and cleaning
    - data analysis means analysing the data
        - statistics of the data,volume of data etc
    - data manipulation means transforming the data from one format to another
        - merging,concatenating etc
    - data cleaning means removing the null data
        - null data mean NaN(not a number)
    - 2 data structures in pandas
    
        1).series
            - sequential data
        2).dataframe
            - data in tabular format i.e.,rows and cols
    -**Installation**
     - pip install pandas
     - import pandas

In [3]:
import pandas as pd
pd.__version__

'1.2.4'

In [4]:
# with string
st="I am from My Home"
pd.Series(st)

0    I am from My Home
dtype: object

In [7]:
# try with input().split()
li = input("type your clg nameeeee:").split()
pd.Series(li)

type your clg nameeeee:a b c d e f u

0    a
1    b
2    c
3    d
4    e
5    f
6    u
dtype: object

In [8]:
print(pd.Series(li))

0    a
1    b
2    c
3    d
4    e
5    f
6    u
dtype: object

In [10]:
# using tuple/list
t = (6,7,8,2,10)
pd.Series(t)

0     6
1     7
2     8
3     2
4    10
dtype: int64

In [11]:
#using nrage
pd.Series(range(10,30,6))

0    10
1    16
2    22
3    28
dtype: int64

In [13]:
# using dictionary
dic={'34' :"thirty four",12:90,'tuple':(9,8,'hi'),'list':[9,6,4]}
s= pd.Series(dic)
s

34       thirty four
12                90
tuple     (9, 8, hi)
list       [9, 6, 4]
dtype: object

In [14]:
s.index #2 get index values

Index(['34', 12, 'tuple', 'list'], dtype='object')

In [17]:
import numpy as np
ar=np.arange(10,40,5)
ab=pd.Series(ar)
ab

0    10
1    15
2    20
3    25
4    30
5    35
dtype: int32

In [18]:
ab.index

RangeIndex(start=0, stop=6, step=1)

In [19]:
ab.index=[1,3,5,7,9,11]

In [20]:
ab.index

Int64Index([1, 3, 5, 7, 9, 11], dtype='int64')

In [21]:
ab

1     10
3     15
5     20
7     25
9     30
11    35
dtype: int32

In [23]:
li2=[1,2,3,4,"hi"]
inx=[num for num in range(1,6)]
pd.Series(li2,index=inx)

1     1
2     2
3     3
4     4
5    hi
dtype: object

In [25]:
# pass the user index to series created using dict
len(dic)

4

In [26]:
ix = [num for num in range(10,14)]
pd.Series(dic,index=ix)

10    NaN
11    NaN
12     90
13    NaN
dtype: object

In [27]:
s['tuple']

(9, 8, 'hi')

In [28]:
s['34':]

34       thirty four
12                90
tuple     (9, 8, hi)
list       [9, 6, 4]
dtype: object

#### dataframes
- data is in 2d format

In [29]:
# dictionary into dataframe
pd.DataFrame(dic) #existed

            34  12 tuple  list
0  thirty four  90     9     9
1  thirty four  90     8     6
2  thirty four  90    hi     4

In [33]:
df=pd.DataFrame(dic)
print(df)

            34  12 tuple  list
0  thirty four  90     9     9
1  thirty four  90     8     6
2  thirty four  90    hi     4

In [34]:
dic

{'34': 'thirty four', 12: 90, 'tuple': (9, 8, 'hi'), 'list': [9, 6, 4]}

In [36]:
data={'int':90,'float':90.67,'str':"smily",'prgm':'workshop'}
df2=pd.DataFrame(data,index=[1,2,3])
df2

   int  float    str      prgm
1   90  90.67  smily  workshop
2   90  90.67  smily  workshop
3   90  90.67  smily  workshop

In [37]:
pd.concat([df,df2]) # concatenation

            34    12 tuple  list   int  float    str      prgm
0  thirty four  90.0     9   9.0   NaN    NaN    NaN       NaN
1  thirty four  90.0     8   6.0   NaN    NaN    NaN       NaN
2  thirty four  90.0    hi   4.0   NaN    NaN    NaN       NaN
1          NaN   NaN   NaN   NaN  90.0  90.67  smily  workshop
2          NaN   NaN   NaN   NaN  90.0  90.67  smily  workshop
3          NaN   NaN   NaN   NaN  90.0  90.67  smily  workshop

In [4]:
 #merging 2 dataframes
import pandas as pd
df3=pd.DataFrame({'Int_rate':[2,1,2,3],'Int_gdp':[50,45,45,67]},index=[2041,2002,2003,2204])
df3

      Int_rate  Int_gdp
2041         2       50
2002         1       45
2003         2       45
2204         3       67

In [5]:
#joining 2 dataframes
import pandas as pde
df4=pd.DataFrame({'low_tier_hpi':[80,90,70,60],'Unemployment':[1,3,5,6]},index=[2001,2003,2003,2005])
df4

      low_tier_hpi  Unemployment
2001            80             1
2003            90             3
2003            70             5
2005            60             6

In [6]:
df3.join(df4)

      Int_rate  Int_gdp  low_tier_hpi  Unemployment
2002         1       45           NaN           NaN
2003         2       45          90.0           3.0
2003         2       45          70.0           5.0
2041         2       50           NaN           NaN
2204         3       67           NaN           NaN

In [7]:
# merging the dataframes having similar column values
m=pd.DataFrame({'a':[4,5,6,7],'b':[30,50,60,70],'c':['a','b','c','d']},index=['first','second','third','fourth'])
m

        a   b  c
first   4  30  a
second  5  50  b
third   6  60  c
fourth  7  70  d

In [10]:
n=pd.DataFrame({'a':[4,9,6,7],'b':[30,80,60,70],'c':['a','b','c','d']},index=['first','second','third','fourth'])
n

        a   b  c
first   4  30  a
second  9  80  b
third   6  60  c
fourth  7  70  d

In [12]:
new=m.merge(n)
new.columns=['f','s','th'] # renaming the col values
new

   f   s th
0  4  30  a
1  6  60  c
2  7  70  d

In [16]:
m.merge(n,on='c') # merging is based on particular col

   a_x  b_x  c  a_y  b_y
0    4   30  a    4   30
1    5   50  b    9   80
2    6   60  c    6   60
3    7   70  d    7   70

In [17]:
n.merge(m,on='a')

   a  b_x c_x  b_y c_y
0  4   30   a   30   a
1  6   60   c   60   c
2  7   70   d   70   d

In [18]:
#date range
dates = pd.date_range('2022-01-01','2022-01-10') #yyyy-mm-dd
pd.Series(dates)

0   2022-01-01
1   2022-01-02
2   2022-01-03
3   2022-01-04
4   2022-01-05
5   2022-01-06
6   2022-01-07
7   2022-01-08
8   2022-01-09
9   2022-01-10
dtype: datetime64[ns]

In [19]:
dt=pd.date_range('2022-01-10',periods=5)
pd.Series(dt)

0   2022-01-10
1   2022-01-11
2   2022-01-12
3   2022-01-13
4   2022-01-14
dtype: datetime64[ns]

In [20]:
temp=[30,32,35,40,31]
pd.Series(temp,index=dt)

2022-01-10    30
2022-01-11    32
2022-01-12    35
2022-01-13    40
2022-01-14    31
Freq: D, dtype: int64

In [21]:
new.index[1]

1

In [22]:
m

        a   b  c
first   4  30  a
second  5  50  b
third   6  60  c
fourth  7  70  d

#### Working with .csv file
    - reading .csv file located at same location
    - pd.read_csv('filename')

In [24]:
marks=pd.read_csv('marks.csv')
marks

  Name  Math   OS  CO
0  'a'    34   32  45
1  'b'    45  654  43
2  'c'    54   45  45

In [27]:
marks.sample(3) #random 3 samples

  Name  Math   OS  CO
2  'c'    54   45  45
0  'a'    34   32  45
1  'b'    45  654  43

In [28]:
marks.head()# first 5 samples

  Name  Math   OS  CO
0  'a'    34   32  45
1  'b'    45  654  43
2  'c'    54   45  45

In [39]:
mr=pd.read_csv('new.csv')
mr

  Name  Math   OS  CO
0  'a'    34   32  45
1  'b'    45  654  43
2  'c'    54   45  45
3  'd'    34   32  45
4  'e'    45  654  43
5  'f'    34   32  45
6  'f'    43   45  43

In [40]:
mr.tail()

  Name  Math   OS  CO
2  'c'    54   45  45
3  'd'    34   32  45
4  'e'    45  654  43
5  'f'    34   32  45
6  'f'    43   45  43

In [50]:
marks['Name']

0    'a'
1    'b'
2    'c'
Name: Name, dtype: object

In [52]:
marks[['Math','OS','CO']] # gettin mmultiple col values

   Math   OS  CO
0    34   32  45
1    45  654  43
2    54   45  45

In [53]:
marks.info

<bound method DataFrame.info of   Name  Math   OS  CO
0  'a'    34   32  45
1  'b'    45  654  43
2  'c'    54   45  45>

In [54]:
marks.dtypes

Name    object
Math     int64
OS       int64
CO       int64
dtype: object

In [55]:
marks.index

RangeIndex(start=0, stop=3, step=1)

In [56]:
marks.columns

Index(['Name', 'Math', 'OS', 'CO'], dtype='object')

In [58]:
marks.describe()

            Math          OS         CO
count   3.000000    3.000000   3.000000
mean   44.333333  243.666667  44.333333
std    10.016653  355.418533   1.154701
min    34.000000   32.000000  43.000000
25%    39.500000   38.500000  44.000000
50%    45.000000   45.000000  45.000000
75%    49.500000  349.500000  45.000000
max    54.000000  654.000000  45.000000

In [60]:
marks.Math.value_counts() # freq of val

45    1
34    1
54    1
Name: Math, dtype: int64

In [61]:
marks['Math'].value_counts()

45    1
34    1
54    1
Name: Math, dtype: int64

In [64]:
marks

  Name  Math   OS  CO
0  'a'    34   32  45
1  'b'    45  654  43
2  'c'    54   45  45

In [67]:
marks.sort_values('Math',ascending=False)

  Name  Math   OS  CO
2  'c'    54   45  45
1  'b'    45  654  43
0  'a'    34   32  45

In [68]:
marks.Math.sum() #sum of 1 col in data

133

In [69]:
marks.isnull()

    Name   Math     OS     CO
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False

In [70]:
marks.isna()

    Name   Math     OS     CO
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False

In [72]:
marks.isnull().sum()

Name    0
Math    0
OS      0
CO      0
dtype: int64

In [73]:
marks.nunique()

Name    3
Math    3
OS      3
CO      2
dtype: int64

In [74]:
clean=marks.dropna()

In [75]:
clean

  Name  Math   OS  CO
0  'a'    34   32  45
1  'b'    45  654  43
2  'c'    54   45  45

In [76]:
marks

  Name  Math   OS  CO
0  'a'    34   32  45
1  'b'    45  654  43
2  'c'    54   45  45